Revit 2022 API
LightGroupManager.CreateGroup Method
 Create a new LightGroup object with the given name
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2013
Syntax
C#
public LightGroup CreateGroup(
	string name
)
Visual Basic
Public Function CreateGroup ( _
	name As String _
) As LightGroup
Visual C++
public:
LightGroup^ CreateGroup(
	String^ name
)
Parameters
name
Type: System.String
 The name to use for the new LightGroup object
Return Value
 The new LightGroup object that was created
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The name is not valid because it is not unique within this LightGroupManager -or- name cannot include prohibited characters.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
LightGroupManager Class
Autodesk.Revit.DB.Lighting Namespace